AuthWebApp/src/conf/xml-resources/web-service-references/casaPort1/wsdl/laure-HP-EliteBook-Folio-9470m_9080/AuthCompositeApp-sun-http-binding/AuthBPEL/ClientAuthWSDL.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="ClientAuthWSDL" targetNamespace="http://j2ee.netbeans.org/wsdl/AuthBPEL/ClientAuthWSDL"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/AuthBPEL/ClientAuthWSDL" xmlns:ns="http://xml.netbeans.org/schema/ClienRequest" xmlns:ns0="http://xml.netbeans.org/schema/ClientReply" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/AuthBPEL/ClientAuthWSDL">
            <xsd:import namespace="http://xml.netbeans.org/schema/ClientReply" schemaLocation="ClientReply.xsd"/>
            <xsd:import namespace="http://xml.netbeans.org/schema/ClienRequest" schemaLocation="ClientRequest.xsd"/>
        </xsd:schema>
    </types>
    <message name="getClientAuthOperationRequest">
        <part name="clientReq" element="ns:ClientRequest"/>
    </message>
    <message name="getClientAuthOperationResponse">
        <part name="clientRep" element="ns0:ClientReply"/>
    </message>
    <portType name="ClientAuthWSDLPortType">
        <operation name="getClientAuthOperation">
            <input name="input1" message="tns:getClientAuthOperationRequest"/>
            <output name="output1" message="tns:getClientAuthOperationResponse"/>
        </operation>
    </portType>
    <plnk:partnerLinkType name="ClientAuthWSDL">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="ClientAuthWSDLPortTypeRole" portType="tns:ClientAuthWSDLPortType"/>
    </plnk:partnerLinkType>
</definitions>

