AuthCompositeApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cli="http://xml.netbeans.org/schema/ClienRequest">
  <soapenv:Body>
    <cli:ClientRequest>
      <cli:username>?string?</cli:username>
      <cli:password>?string?</cli:password>
    </cli:ClientRequest>
  </soapenv:Body>
</soapenv:Envelope>